## Terraform Plan

<details>
<summary>Click to expand</summary>

```hcl
random_password.db_password: Refreshing state... [id=none]
google_project_service.iam: Refreshing state... [id=ciridae-take-home-jose/iam.googleapis.com]
google_compute_firewall.allow_internal: Refreshing state... [id=projects/ciridae-take-home-jose/global/firewalls/allow-internal]
google_compute_firewall.deny_all_ingress: Refreshing state... [id=projects/ciridae-take-home-jose/global/firewalls/deny-all-ingress]
google_compute_firewall.allow_vpc_connector_to_sql: Refreshing state... [id=projects/ciridae-take-home-jose/global/firewalls/allow-vpc-connector-to-sql]
google_project_service.containerregistry: Refreshing state... [id=ciridae-take-home-jose/containerregistry.googleapis.com]
google_project_service.run: Refreshing state... [id=ciridae-take-home-jose/run.googleapis.com]
google_project_iam_audit_config.cloudsql: Refreshing state... [id=ciridae-take-home-jose/audit_config/cloudsql.googleapis.com]
google_project_service.dns: Refreshing state... [id=ciridae-take-home-jose/dns.googleapis.com]
google_project_service.vpcaccess: Refreshing state... [id=ciridae-take-home-jose/vpcaccess.googleapis.com]
google_project_iam_audit_config.iam: Refreshing state... [id=ciridae-take-home-jose/audit_config/iam.googleapis.com]
google_project_service.certificatemanager: Refreshing state... [id=ciridae-take-home-jose/certificatemanager.googleapis.com]
google_project_service.secretmanager: Refreshing state... [id=ciridae-take-home-jose/secretmanager.googleapis.com]
google_project_iam_audit_config.secretmanager: Refreshing state... [id=ciridae-take-home-jose/audit_config/secretmanager.googleapis.com]
google_project_iam_audit_config.cloudrun: Refreshing state... [id=ciridae-take-home-jose/audit_config/run.googleapis.com]
google_project_service.storage: Refreshing state... [id=ciridae-take-home-jose/storage.googleapis.com]
google_project_service.compute: Refreshing state... [id=ciridae-take-home-jose/compute.googleapis.com]
google_project_service.servicenetworking: Refreshing state... [id=ciridae-take-home-jose/servicenetworking.googleapis.com]
google_project_iam_audit_config.storage: Refreshing state... [id=ciridae-take-home-jose/audit_config/storage.googleapis.com]
google_service_account.db_migrate: Refreshing state... [id=projects/ciridae-take-home-jose/serviceAccounts/db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_secret_manager_secret.db_password: Refreshing state... [id=projects/ciridae-take-home-jose/secrets/database-password]
google_project_service.sqladmin: Refreshing state... [id=ciridae-take-home-jose/sqladmin.googleapis.com]
google_dns_managed_zone.main: Refreshing state... [id=projects/ciridae-take-home-jose/managedZones/ciridae-deploy-zone]
google_secret_manager_secret.db_connection_name: Refreshing state... [id=projects/ciridae-take-home-jose/secrets/database-connection-name]
google_service_account.backend: Refreshing state... [id=projects/ciridae-take-home-jose/serviceAccounts/backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_storage_bucket.frontend: Refreshing state... [id=ciridae-take-home-jose-frontend]
google_secret_manager_secret.database_url: Refreshing state... [id=projects/ciridae-take-home-jose/secrets/database-url]
google_compute_global_address.frontend_ip: Refreshing state... [id=projects/ciridae-take-home-jose/global/addresses/frontend-ip]
google_compute_managed_ssl_certificate.frontend: Refreshing state... [id=projects/ciridae-take-home-jose/global/sslCertificates/frontend-ssl-cert]
google_compute_network.private_network: Refreshing state... [id=projects/ciridae-take-home-jose/global/networks/todo-app-network]
google_dns_record_set.api_cname: Refreshing state... [id=projects/ciridae-take-home-jose/managedZones/ciridae-deploy-zone/rrsets/api.ciridae-deploy.com./CNAME]
google_project_iam_member.backend_sql_client: Refreshing state... [id=ciridae-take-home-jose/roles/cloudsql.client/serviceAccount:backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.backend_secret_accessor: Refreshing state... [id=ciridae-take-home-jose/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_compute_backend_bucket.frontend: Refreshing state... [id=projects/ciridae-take-home-jose/global/backendBuckets/frontend-backend-bucket]
google_storage_bucket_iam_member.frontend_public: Refreshing state... [id=b/ciridae-take-home-jose-frontend/roles/storage.objectViewer/allUsers]
google_project_iam_member.migrate_sql_client: Refreshing state... [id=ciridae-take-home-jose/roles/cloudsql.client/serviceAccount:db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.migrate_secret_accessor: Refreshing state... [id=ciridae-take-home-jose/roles/secretmanager.secretAccessor/serviceAccount:db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/523433099302/secrets/database-password/versions/2]
google_dns_record_set.root_a: Refreshing state... [id=projects/ciridae-take-home-jose/managedZones/ciridae-deploy-zone/rrsets/ciridae-deploy.com./A]
google_dns_record_set.www_a: Refreshing state... [id=projects/ciridae-take-home-jose/managedZones/ciridae-deploy-zone/rrsets/www.ciridae-deploy.com./A]
google_vpc_access_connector.backend_connector: Refreshing state... [id=projects/ciridae-take-home-jose/locations/us-central1/connectors/backend-connector]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/ciridae-take-home-jose/global/addresses/private-ip-address]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/ciridae-take-home-jose/regions/us-central1/subnetworks/todo-app-subnet]
google_compute_url_map.https_redirect: Refreshing state... [id=projects/ciridae-take-home-jose/global/urlMaps/https-redirect]
google_compute_url_map.frontend: Refreshing state... [id=projects/ciridae-take-home-jose/global/urlMaps/frontend-lb]
google_compute_target_http_proxy.https_redirect: Refreshing state... [id=projects/ciridae-take-home-jose/global/targetHttpProxies/https-redirect-proxy]
google_compute_target_https_proxy.frontend: Refreshing state... [id=projects/ciridae-take-home-jose/global/targetHttpsProxies/frontend-https-proxy]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fciridae-take-home-jose%2Fglobal%2Fnetworks%2Ftodo-app-network:servicenetworking.googleapis.com]
google_compute_global_forwarding_rule.frontend_http: Refreshing state... [id=projects/ciridae-take-home-jose/global/forwardingRules/frontend-http]
google_compute_global_forwarding_rule.frontend_https: Refreshing state... [id=projects/ciridae-take-home-jose/global/forwardingRules/frontend-https]
google_sql_database_instance.main: Refreshing state... [id=todo-app-db]
google_sql_database.database: Refreshing state... [id=projects/ciridae-take-home-jose/instances/todo-app-db/databases/todos]
google_secret_manager_secret_version.db_connection_name: Refreshing state... [id=projects/523433099302/secrets/database-connection-name/versions/1]
google_sql_user.user: Refreshing state... [id=app_user//todo-app-db]
google_secret_manager_secret_version.database_url: Refreshing state... [id=projects/523433099302/secrets/database-url/versions/3]
google_cloud_run_v2_job.db_migrate: Refreshing state... [id=projects/ciridae-take-home-jose/locations/us-central1/jobs/db-migrate]
google_cloud_run_v2_service.backend: Refreshing state... [id=projects/ciridae-take-home-jose/locations/us-central1/services/backend]
google_cloud_run_v2_service_iam_member.backend_public: Refreshing state... [id=projects/ciridae-take-home-jose/locations/us-central1/services/backend/roles/run.invoker/allUsers]
google_cloud_run_domain_mapping.api: Refreshing state... [id=locations/us-central1/namespaces/ciridae-take-home-jose/domainmappings/api.ciridae-deploy.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_compute_firewall.allow_internal will be destroyed
  # (because google_compute_firewall.allow_internal is not in configuration)
  - resource "google_compute_firewall" "allow_internal" {
      - creation_timestamp      = "2025-12-31T17:43:56.027-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/ciridae-take-home-jose/global/firewalls/allow-internal" -> null
      - name                    = "allow-internal" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/ciridae-take-home-jose/global/networks/todo-app-network" -> null
      - priority                = 1000 -> null
      - project                 = "ciridae-take-home-jose" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/ciridae-take-home-jose/global/firewalls/allow-internal" -> null
      - source_ranges           = [
          - "10.0.0.0/24",
          - "10.8.0.0/28",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [] -> null
          - protocol = "icmp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "tcp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "udp" -> null
        }

      - log_config {
          - metadata = "INCLUDE_ALL_METADATA" -> null
        }
    }

  # google_compute_firewall.allow_vpc_connector_to_sql will be destroyed
  # (because google_compute_firewall.allow_vpc_connector_to_sql is not in configuration)
  - resource "google_compute_firewall" "allow_vpc_connector_to_sql" {
      - creation_timestamp      = "2025-12-31T17:43:56.149-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/ciridae-take-home-jose/global/firewalls/allow-vpc-connector-to-sql" -> null
      - name                    = "allow-vpc-connector-to-sql" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/ciridae-take-home-jose/global/networks/todo-app-network" -> null
      - priority                = 1000 -> null
      - project                 = "ciridae-take-home-jose" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/ciridae-take-home-jose/global/firewalls/allow-vpc-connector-to-sql" -> null
      - source_ranges           = [
          - "10.8.0.0/28",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "5432",
            ] -> null
          - protocol = "tcp" -> null
        }

      - log_config {
          - metadata = "INCLUDE_ALL_METADATA" -> null
        }
    }

  # google_compute_firewall.deny_all_ingress will be destroyed
  # (because google_compute_firewall.deny_all_ingress is not in configuration)
  - resource "google_compute_firewall" "deny_all_ingress" {
      - creation_timestamp      = "2025-12-31T17:43:55.656-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/ciridae-take-home-jose/global/firewalls/deny-all-ingress" -> null
      - name                    = "deny-all-ingress" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/ciridae-take-home-jose/global/networks/todo-app-network" -> null
      - priority                = 65535 -> null
      - project                 = "ciridae-take-home-jose" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/ciridae-take-home-jose/global/firewalls/deny-all-ingress" -> null
      - source_ranges           = [
          - "0.0.0.0/0",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - deny {
          - ports    = [] -> null
          - protocol = "all" -> null
        }

      - log_config {
          - metadata = "INCLUDE_ALL_METADATA" -> null
        }
    }

  # google_dns_managed_zone.dummy will be created
  + resource "google_dns_managed_zone" "dummy" {
      + creation_time    = (known after apply)
      + description      = "Dummy resource"
      + dns_name         = "dummy-deploy.com."
      + effective_labels = (known after apply)
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "dummy-deploy-zone"
      + name_servers     = (known after apply)
      + project          = "ciridae-take-home-jose"
      + terraform_labels = (known after apply)
      + visibility       = "public"

      + dnssec_config {
          + kind          = "dns#managedZoneDnsSecConfig"
          + non_existence = (known after apply)
          + state         = "on"
        }
    }

Plan: 1 to add, 0 to change, 3 to destroy.
```

</details>